<template>
  <layout :showNavbar="isNavbar">
    <div class="protocol-container">
      <div class='protocol-wrap'>
        <div class='pro-sub'
             style='margin-bottom: 20px;'>编号：{{bidId}}
        </div>
        <div class='pro-main'
             style='margin-bottom: 20px;'>
          甲方 （借款人）：{{detail.borrowerName}} <br>
          身份证号码：{{detail.borrowerIdentity}} <br>
        </div>
        <div class='pro-main'
             style='margin-bottom: 20px;'>
          乙方 （出借人）：{{detail.lenderName}} <br>
          身份证号码：{{detail.lenderIdentity}} <br>
        </div>
        <div class='pro-main'
             style='margin-bottom: 20px;'>
          丙方 （居间方）：浙江格爱网络科技有限公司 <br>
          住址：浙江省杭州市拱墅区万达商业中心3幢1单元2118室 <br>
        </div>
        <div class='pro-main'>
          丙方系从事网络借贷信息中介业务活动的金融信息中介企业，运营管理着闪电借条平台，为平台用户提供投融资信息发布及交易撮合服务，并收取享有服务管理费用。甲、乙双方均已成功注册为丙方用户。甲方是需要筹集资金的借款人，需要通过丙方平台发布各借款信息筹集资金。乙方是拥有充足的合法资金予以支配的出借人，通过丙方平台选择甲方作为其投资目标。各方根据平等、自愿的原则，达成本协议。
        </div>

        <div class='pro-title'>第一条 借款详情</div>
        <div class='pro-sub'>
          甲方同意通过丙方平台向乙方借款明细如下，乙方同意通过丙方平台向甲方发放下列借款： <br>
          <table class='table-simple'>
            <tr>
              <td>借款本金：人民币{{ detail.bidAmount }}元（大写： {{detail.bidAmountCn}}）</td>
            </tr>
            <tr>
              <td>借款年化利率（%）：{{detail.bidRate}}</td>
            </tr>
            <tr>
              <td>借款起始日：{{detail.startTime}}</td>
            </tr>
            <tr>
              <td>借款期限：{{detail.bidPeriod}} {{bidPeriodTypeMap[detail.bidPeriodType]}}</td>
            </tr>
            <tr>
              <td>借款到期日：{{detail.endTime}}</td>
            </tr>
            <tr>
              <td>还款方式：一次性还本付息</td>
            </tr>
            <tr>
              <td>借款用途：{{bidUseTypeMap[detail.bidUseType]}}</td>
            </tr>
          </table>

          <br> （注：因丙方开展运营活动，给予甲方部分补贴或减免的，以丙方平台的运营规则与活动解释为准）
          <br> 1. 借款期限是指借款起始日至借款到期日之间的期间，发生逾期还款的，协议期限延续至实际还清款项日。
          <br> 2. 乙方同意出借资金的，自本协议第一条约定借款金额到达甲方账户的次日开始计息。
          <br> 3. 还款日即借款到期日，是指借款人将借款本息、逾期费用（若有）等归还至出借人账户的日期，实际还款日以甲方还款到达乙方账户为准。
          <br> 4. 一次性还本付息：利息=借款本金*年化利率/365 *借款期限，全部本金和利息于借款到期日支付。
          <br> 5.
          出借资金划转：乙方不可撤销的授权，在本协议生效的同时，丙方合作的第三方支付机构即将金额等同于本协议第一条所列的“借款本金数额”的资金，由乙方账户下划转至甲方或甲方指定第三方的账户中，划转完毕即视为借款发放成功，划转完毕之日视为借款起始日。

        </div>

        <div class='pro-title'>第二条 正常还款</div>
        <div class='pro-sub'>
          1.
          还款方式以第一条中列明的方式为准，甲方应于还款日24：00之前将借款本金、利息等应支付的款项归还至乙方账户。甲方可通过丙方平台类似点击“立即还款”选项，或经由丙方认可的其他方式进行还款操作，按时足额将还款金额支付至乙方账户。由于甲方余额不足、账户问题、甲方操作失误等原因导致还款失败的由甲方承担相应责任。
          <br> 2. 乙方不可撤销地授权丙方向丙方合作的第三方支付机构发出划款指令，将甲方还款金额支付至乙方账户。
          <br> 3. 甲方同意，丙方有权通过电话或短信、平台信息推送等方式提醒甲方还款。
        </div>


        <div class='pro-title'>第三条 逾期还款</div>
        <div class='pro-sub'>
          1. 甲方未能在任何一个还款日24:00前将应还金额足额支付至乙方账户的，或未能通过经由丙方认可的其他方式进行还款操作的，视作逾期还款。
          <br>2. 甲方逾期还款的，每逾期一日按照应还借款金额的
          <span style='color: black;font-weight: bold;'><span style='text-decoration: underline;'>{{detail.bidOverdueRate}}</span>％</span>支付逾期费用。
          <br>3. 甲方发生任何一期逾期超过3日，甲方个人信息将可能进入信用征信系统，由此产生的后果由甲方承担。
        </div>

        <div class='pro-title'>第四条 提前还款</div>
        <div class='pro-sub'>
          1. 甲方可以在丙方平台发起提前还款服务申请，服务是否可用以操作界面展示为准（受银行、第三方支付机构结算等影响，部分日期可能无法发起申请）。
          <br> 2. 甲方选择提前还款的，应于提前还款日向乙方支付借款本金、利息（按第一条约定期限对应总利息为准）。
          <br> 3. 甲方选择提前还款的，丙方已收取的居间服务费用不予退还。
          <br> 4. 甲方提前还款的，乙方享有收取甲方实际持有天数的利息，而非本协议约定期限内的全部利息。
        </div>


        <div class='pro-title'>第五条 债权、债务转让</div>
        <div class='pro-sub'>
          1. 未经乙方或乙方委托丙方事先书面（包括但不限于电子邮件等方式）同意，甲方不得将本协议项下的任何权利义务转让给任何第三方。
          <br>2.
          甲方知晓并同意乙方于本协议履行过程中可能将其享有的债权的全部或部分转让给不特定的第三人，且转让次数无限定。乙方可通过签订《债权转让协议》向第三方转让本协议项下权利义务，转让后甲方应即向新的债权人履行本协议项下全部义务。
          <br>3. 乙方通过本平台将其债权全部或部分转让的，本借款协议项下对应权利一并转让给债权受让人，包括但不限于主张罚息、利息、解除合同等权利。
        </div>


        <div class='pro-title'>第六条 费用</div>
        <div class='pro-sub'>
          1. 甲方、乙方已充分知晓，丙方提供本协议所约定的服务可向乙方收取相关居间服务费用。
          <br> 2. 各方知晓并认可自行缴纳可能产生的税费。

        </div>


        <div class='pro-title'>第七条 承诺与保证</div>
        <div class='pro-sub'>
          1. 甲方承诺与保证
          <br> 1）甲方在此确认其为具有完全民事权利能力和完全民事行为能力的主体，有权签订并履行本协议，并充分知晓民间借贷行为可能存在的各类风险。
          <br>
          2）甲方在此保证并承诺其已经真实、准确、完整的提供其在所有网络借贷信息中介机构未偿还的借款信息，并将就该等信息的不时更新及时通知丙方。因甲方拒绝提供相关借款信息或隐瞒、遗漏、误报、或未及时告知该等借款信息引致的一切法律后果，均应当由甲方自行承担。
          <br>
          3）甲方在此保证并承诺其已经阅读并了解包括但不限于《网络借贷信息中介机构业务活动管理办法》等在内的相关法律法规，并承诺其不会从事法律法规和网络借贷有关监管规定禁止从事的其他活动。若甲方为自然人，在丙方以及其他所有网络借贷信息中介机构平台举借债务的合计借款余额上限不超过人民币100万元；若甲方为法人或其他组织的，在丙方以及其他所有网络借贷信息中介机构平台举借债务的合计借款余额上限不超过人民币500万元。
          <br> 4）甲方承诺根据本协议列明的借款用途使用借款资金，并保证不挪用借款资金或将借款资金用于以下目的和用途：
          <br> ①以任何形式进入证券市场，或用于股本权益性投资；
          <br> ②用于房地产项目开发；
          <br> ③用于赌博；
          <br> ④用于国家法律法规明令禁止或限制的各项其他活动。
          <br> 2. 乙方承诺和保证
          <br>
          1）乙方在此确认其为具有完全民事权利能力和完全民事行为能力的个体，有权签订并履行本协议。乙方保证其所用于出借的资金来源合法，且乙方是该资金的合法支配权人，如第三方对资金归属、支配权、合法性等问题主张异议且获得支持的，乙方应当就其给他方造成的损失赔偿损失。
          <br> 2）乙方在此确认并承诺其具备投资风险意识、风险识别能力、拥有非保本类金融产品投资的经历并熟悉互联网，了解本协议项下融资项目的借贷风险并且确认具有相应的风险认知和承受能力，并且自行承担借贷产生的本息损失。
          <br> 3）乙方承诺任何发自于乙方注册时提供的移动电话号码所发送的内容均为本人的真实意思表示。
          <br> 4）乙方在此承诺通过本借款协议所获得的收益自行申报并缴纳税款。
          <br> 3. 各方承诺与保证
          <br>
          1）甲方、乙方应及时并如实向对方及丙方、其他第三方提供本人信息（包括但不限于姓名、身份证号、企业或组织名称、统一社会信用代码、联系方式、联系地址、职业信息、联系人信息、收入及负债信息、在其他网络借贷平台借款情况等）以及借款用途等相关信息。
          <br>
          根据监管要求，甲方理解并承诺，甲方通过丙方的服务与乙方达成借贷关系后，有义务向丙方如实披露本协议项下借贷资金的运用情况、甲方经营状况及财务状况、甲方还款能力变化情况、甲方涉诉及受行政处罚情况等可能影响其还款的重大信息等。
          <br> 2）甲方、乙方承诺并保证向其他各方提供的所有本人信息均真实、完整、有效、及时。因上述任何本人信息及资料的变更、修改、停用等，至少提前2个工作日通知其他各方。
          <br> 3）如甲方或乙方变更账户信息（账户名称、账号等）、通讯地址的，应当至少在款项交付日前2个工作日通知丙方。如因未能遵守上述承诺而导致的损失，由各方自行承担。
          <br> 4）各方承诺，各方不会利用丙方平台进行信用卡套现、洗钱、非法集资或其他不正当交易行为，否则应依法独立承担法律责任。
          <br>
          5）各方确认，甲方和乙方授权和委托丙方根据本协议所采取的全部行动和措施的法律后果均归属于甲方和乙方本人；在任何情形下，丙方不是本协议项下任何借款或债务的债务人，亦无需以其自有资金偿还本协议项下的任何借款或最终债务。
          <br>
          6）各方确认，丙方或丙方的合作方因计算机系统维护、故障、黑客攻击、电信部门技术调整或故障、网站升级、存管银行/第三方支付机构或金融相关等部门的意外事件、法律法规及政策调整、不可抗力等状况导致无法正常运作，使甲方、乙方无法正常使用各项本协议项下服务时，丙方或丙方的合作方不承担由此产生的任何违约责任及侵权责任。
          <br> 7）各方知晓并认可丙方与第三方支付机构的合作，确认并同意因资金在途或划转延迟等可能产生的利息收益、零头归丙方所有，并允许存在因技术系统计算、四舍五入等可能产生的误差。

        </div>


        <div class='pro-title'>第八条 违约</div>
        <div class='pro-sub'>
          1. 发生下列任何一项或几项情形的，视为甲方违约：
          <br>1）甲方违反其在本协议所做的任何承诺和保证的；
          <br>2）甲方的任何财产遭受没收、征用、查封、扣押、冻结等可能影响其履约能力的不利事件，且不能及时提供有效补救措施的；
          <br>3）甲方的财务状况出现影响其履约能力的不利变化，且不能及时提供有效补救措施的。
          <br>4）甲方逾期还款的。
          <br>2. 若甲方违约或丙方合理判断甲方可能发生违约事件的，乙方及/或乙方的债权受让人（或授权丙方）有权采取下列任何一项或几项救济措施：
          <br>1）立即暂缓、取消发放全部或部分借款；
          <br>2）宣告已发放借款全部提前到期，甲方应立即偿还所有应付款项；
          <br>3）解除本协议；
          <br>4）采取法律、法规以及本协议约定的其他救济措施。

        </div>


        <div class='pro-title'>第九条 证据和计算</div>
        <div class='pro-sub'>
          1.
          本协议各方确认并同意，由丙方对本协议项下所涉的任何金额进行计算；丙方可通过其自身及其合作的第三方支付机构提供的电子数据信息进行计算、统计，对法院需要认定的必要费用提供财务凭证。在无明显错误的情况下，上述针对本协议项下任何金额的任何证明或确定，应作为该金额有关事项的终局证明。
          <br> 2. 甲乙双方委托丙方对相关金额进行计算，并在丙方平台发布或更新具体信息。上述还款明细中列明的每月还款本息金额若与发布或更新的还款明细不一致的，以平台上发布或更新的还款明细为准。

        </div>


        <div class='pro-title'>第十条 保密条款</div>
        <div class='pro-sub'>
          1. 各方应将其在本协议及其附属合同、文件的签订和履行过程中取得的有关内容以及与此等内容有关的任何文件、资料或信息视为保密信息（以下简称“保密信息”）。
          <br>2. 任意一方向其他各方承诺，其不会使用或向非本协议方披露保密信息，除非事先得到其他三方的书面同意。
          <br>3. 下述信息不适用于保密信息的披露：
          <br>1）该等信息已为公众所知；
          <br>2）任何适用法律要求披露的、或者有权的司法机关、政府机关、监管机关要求披露的、或者法院裁定要求披露的信息；
          <br>3）相关方在正当履行本合同时披露的或随本合同而相应披露的信息；
          <br>4）相关方从第三方获得的且无须承担保密义务的信息。
          <br>但是上述第（3）项或第（4）项信息的披露必须基于接收方对上述信息保密并且接收方仅可为披露之目的使用上述信息。
          <br>4.
          未经本协议各方以书面方式一致同意，任何一方不得向除政府审批机构、顾问（包括律师、会计师、评估师和其他专业顾问）、为本合同的交易提供服务的机构、股东和相关工作人员之外的任何与本合同无利害关系的第三人披露本合同任何条款。
          <br>5. 本协议项下的任何一方应采取所有其他必要、适当的措施，以确保保密信息的保密性。
          <br>6. 不论本协议是否有效或者是否履行完毕，本条中规定的保密义务不因此受到任何影响。
          <br>7. 保密条款在本协议合法解除、终止或履行完毕后继续有效。

        </div>


        <div class='pro-title'>第十一条 知识产权</div>
        <div class='pro-sub'>
          1.
          丙方、丙方合作方及关联公司所有系统、提供的服务、本协议所有内容，包括但不限于产品名、商标、网站名、网站架构、网站画面、网站设计、著作、图片、档案等无形资产（包括但不限于商标权、专利权、著作权、商业秘密等）均由丙方、丙方合作方或关联公司所有。
          <br> 2. 非经丙方书面同意，任何人不得擅自使用、修改、反向工程、反汇编、反编译、复制、公开传播、散布、发行或公开发表丙方程序或内容。
          <br> 3. 尊重知识产权是甲方、乙方应尽的义务，任何人侵犯了丙方和/或关联公司、丙方合作方的知识产权，应当承担损害赔偿责任，被侵害方拥有追究责任的权利。

        </div>


        <div class='pro-title'>第十二条 通知</div>
        <div class='pro-sub'>
          1.
          本协议任何一方根据本协议约定做出的通知和/或文件均应以书面形式做出（不包括本协议及相关协议因贷后管理服务所涉内容），可以短信、邮件、专人送达、挂号邮递、特快专递或通过丙方平台发布等方式传送，具体送达信息以本协议约定或各方在丙方平台的注册信息或登记信息为准。
          <br> 2. 通知在下列日期视为送达：
          <br> 1）短信、邮件发出即视为送达，专人递送的通知，在专人递送之交付日为有效送达；
          <br> 2）以挂号信（付清邮资）发出的通知，在寄出（以邮戳为凭）后的五（5）个工作日内为有效送达；
          <br> 3）以特快专递（付清邮资）发出的通知，在寄出（以邮戳为凭）后的三个（3）工作日内为有效送达；
          <br> 4）通过丙方平台发布的方式通知的，在丙方平台发布之时即为有效送达。

        </div>


        <div class='pro-title'>第十三条 法律适用和管辖</div>
        <div class='pro-sub'>
          如果各方在本协议履行过程中发生不可协商解决的争议，由丙方所在地人民法院管辖，因诉讼产生的诉讼费、律师代理费等相关费用由败诉方承担。
        </div>


        <div class='pro-title'>第十四条 其他</div>
        <div class='pro-sub'>
          1. 本协议自甲方通过丙方平台点击类似“确认借款”选项发布借款信息后成立，自乙方将借款本金支付至甲方账户之日起生效。
          <br> 2. 甲方发布的相应借款需求在规定时间内未取得借款或甲方在借款成功前撤回借款申请的，本协议自始不生效。
          <br> 3. 甲方将本协议下全部本金、利息、滞纳金、违约金及其他相关费用全部偿还完毕之时，本协议自动终止。
          <br> 4. 本协议中部分条款根据相关法律法规等的规定成为无效，或部分无效时，该等无效不影响本协议项下其他条款的效力，各方仍应履行其在本协议项下的义务。
          <br> 5. 本协议若有修改或者补充的，均由丙方以电子文本形式在丙方平台进行公布，修改后或者补充后的内容与本协议有冲突的，以修改后或者补充后的效力为准。
          <br> 6. 本协议项下的附件和补充协议构成本协议不可分割的一部分。
          <br> 7. 本协议各方委托丙方或丙方合作第三方机构保管所有与本协议有关的书面文件或电子信息；本协议各方确认并同意由丙方提供的与本协议有关的书面文件或电子信息在无明显错误的情况下应作为本协议有关事项的终局证明。
          <br> （以下无正文）

        </div>

        <div class='pro-main'
             style='margin-bottom: 20px; margin-top: 20px;'>
          甲方 （借款人）：{{detail.borrowerName}} <br>
          日期：{{detail.contactTime}} <br>
        </div>
        <div class='pro-main'
             style='margin-bottom: 20px;'>
          乙方 （出借人）：{{detail.lenderName}} <br>
          日期：{{detail.contactTime}} <br>
        </div>
        <div class='pro-main'
             style='margin-bottom: 20px;'>
          丙方 （居间方）：浙江格爱网络科技有限公司<br>
          日期：{{detail.contactTime}} <br>
        </div>

      </div>
    </div>
  </layout>
</template>
<script>
  export default {
    data() {
      return {
        isNavbar: true,
        bidId: '',
        token: '',
        preview: '',

        detail: {},
        bidPeriodTypeMap: {
          day: '天',
          month: '月'
        },
        bidUseTypeMap: {
          consume: '消费',
          medical: '医疗',
          beautify_feature: '美容',
          capital_turn: '短期周转',
          education: '教育',
          other: '其他',
        }
      }
    },
    created() {
      console.log(this.$route.query)
      let query = this.$route.query || {}

      if (query.preview != 'yes') {
        this.bidId = query.bidId
        this.token = query.token
        USER.setToken(query.token)
        const self = this

        setTimeout(() => {
          self.getDetail()
        }, 300)
      }
    },
    methods: {
      getDetail() {
        AXIOS.post('/auth/bid/contact', {
          bidId: this.bidId
        }).then(res => {
          this.detail = res
          console.log(res)
        })
      }
    }
  }
</script>
<style lang="less">
  @import "protocol";
</style>
