<template>
  <layout :showNavbar="isNavbar">
    <div class="protocol-container">
      <div class='protocol-wrap'>
        <div class='pro-main'>
          本平台为浙江格爱网络科技有限公司所有并负责运营（以下本平台均指借条平台及浙江格爱网络科技有限公司），并依据本协议的规定为注册用户提供服务，本协议在注册用户和本平台间具有合同上的法律效力。 <br>
          本协议内容包括本协议的所有条款及本平台已经发布的或将来可能发布的各类规则。所有规则为本协议不可分割的一部分，与协议正文具有同等法律效力。本协议是注册用户与本平台共同签订的，适用于用户在本平台的全部活动。 <br>
          本平台有权根据需要修改本协议或根据本协议制定、修改各类具体规则并在本平台相关系统板块发布，不再另行向用户做个别通知，用户有权选择继续或者停止使用本平台的服务。若您在本协议及具体规则内容变更后继续使用本服务的，表示您已充分阅读、理解并接受修改后的协议和具体规则内容，也将遵循修改后的协议和具体规则使用本平台的服务，同时就您在协议和具体规则修订前通过本平台进行的交易及其效力，视为您已同意并已按照本协议及有关规则进行了相应的授权和追认。若您不同意修改后的协议内容，您应停止使用本平台的服务，本平台也有权不经告知即中止、终止本协议或者限制您进入本平台的全部或者部分板块且不承担任何法律责任，但该中止、终止或限制行为并不能豁免您在本平台已经进行交易项下所应承担的义务。
          <br>
          为了保障用户的权益，本平台在此特别提醒您认真阅读、充分理解本协议各条款，特别是其中所涉及的免除及限制本平台责任的条款、对注册用户权利限制的条款等。请您审慎阅读并选择接受或不接受本协议。除非您接受本协议所有条款，否则您无权注册本平台或使用本平台所提供的一切服务。您一经注册或使用本平台服务即视为对本协议全部条款已充分理解并完全接受，并承诺遵守中国的各类法律规定，如有违反而导致任何法律后果的发生，您将以自己的名义独立承担相应的法律责任。
          <br>
        </div>


        <div class='pro-title'>第一章 本协议的签署</div>
        <div class='pro-sub'>
          第一条
          本平台只接受持有中国大陆（不包括香港特区、澳门特区及台湾地区）有效身份证件的18周岁以上且具有完全民事行为能力的自然人或在中国大陆注册或成立并有效存续的法人及其他组织成为平台用户。如您不符合资格，请勿注册，否则本平台有权随时终止您的用户资格。<br>
          第二条
          签署本服务协议后，本服务协议即在您和本平台之间产生法律效力。本协议不涉及您与本平台的其他用户之间因网上交易而产生的法律关系及法律纠纷，但您在此同意将全面接受和履行与本平台其他用户在本平台签订的任何电子法律文本，并承诺按该法律文本享有或放弃相应的权利、承担或豁免相应的义务。<br>
        </div>

        <div class='pro-title'>第二章 本平台的服务内容</div>
        <div class='pro-sub'>
          第三条
          本平台服务内容主要包括用户信用评估、根据用户需求发布交易信息、提供交易管理服务、提供客户服务等，具体详情以本平台当时提供的服务内容为准。本平台的部分服务需要用户根据本平台的要求完成身份信息及银行卡等认证，未进行身份信息及银行卡等认证的用户将无法使用本平台该服务。<br>
          第四条 本平台将为用户提供以下信用评估、信息发布及查询服务：<br>
          1．用户发布的各种信息及资料由用户自主对信息的真实性、合法性、有效性负责，出借用户应依其独立判断做出决策。出借用户如据此进行交易的，产生的风险由用户自行承担。<br>
          2．用户在平台上发布借款信息的，同意授权平台向任何信用机构获取用户的个人资料和信用记录，同时授权平台向任何第三方核实该等资料和记录。平台将合理使用用户的个人资料和信用记录，并将用户信息登记发布在平台上（其中用户基础资料无偿查询）。用户同意授权平台以有偿的方式向平台有出借意愿的用户展示其他风控征信资料。因此产生的相关法律责任及法律后果由本人自行承担。<br>
          3．用户在平台上发现有出借意愿的借款项目时，可免费查看借款人相关基础资料（如借款人姓名、性别、年龄、联系方式、号码归属地、入网时间、户籍、GPS所在地、频繁联系地等），但涉及用户风控征信资料信息的须在向平台支付一定费用后方可查看。<br>
          4. 平台根据用户提交信息及通过第三方获取的用户个人材料及信用记录评估用户在平台上的可借额度。用户仅可在平台限定的可借款额度范围内申请借款。<br>
          第五条 本平台将为用户提供以下交易管理服务：<br>
          1．用户在本平台进行注册时将生成用户账户，用户账户将记载用户在本平台的活动，上述用户账户是用户登录本平台的唯一账户。<br>
          2．用户保证并承诺通过本平台进行交易的资金来源合法。<br>
          3．用户确认，用户在本平台按本平台服务流程所确认的交易状态，将成为本平台为用户进行相关交易或操作（包括但不限于支付或收取款项、冻结资金、订立合同等）的不可撤销的指令。用户同意相关指令的执行时间以本平台在本平台系统中进行实际操作的时间为准。用户同意本平台有权依据本协议及本平台相关纠纷处理规则等约定对相关事项进行处理。用户未能及时对交易状态进行修改、确认或未能及时提交相关申请所引起的任何纠纷或损失由用户自行负责，本平台不承担任何责任。<br>
          4．用户理解并同意，本平台向符合条件的用户提供服务。本平台对在本平台上进行的借贷交易行为不承担任何责任，本平台无法也没有义务保证用户在发出出借或借贷意向后，能够实际获得借贷或出借成功，用户因前述原因导致的损失由用户自行承担，本平台不承担责任。<br>
          5．用户通过本平台进行各项交易或接受交易款项时，若用户未遵从本服务协议条款或本平台公布的交易规则中的操作指示，本平台不承担任何责任。若在上述状况下款项已拨入用户在平台上的相关存管账户下，用户同意本平台有权直接从相关用户存管账户中扣回款项。此款项若已汇入用户的银行账户，用户同意本平台有向用户事后索回的权利，由此产生的追索费用由用户承担。<br>
          6．本平台基于交易安全等方面的考虑设定涉及交易的相关事项，包括但不限于交易限额、交易次数等，用户了解本平台的前述设定可能会对交易造成一定不便，并对此没有异议。
          <br>7．如果本平台发现了因系统故障或其他任何原因导致的处理错误，无论有利于本平台还是有利于用户，本平台都有权纠正该错误。如果该错误导致用户实际收到的款项多于应获得的金额，则无论错误的性质和原因为何，本平台保留纠正不当执行的交易的权利，用户应根据本平台向用户发出的有关纠正错误的通知的具体要求返还多收的款项或进行其他操作。用户理解并同意，用户因前述处理错误而多付或少付的款项均不计利息，本平台不承担因前述处理错误而导致的任何损失或责任。
          <br>第六条 本平台将为用户提供以下客户服务：
          <br>
          1．银行卡认证：为使用本平台对接的第三方支付机构提供的充值、取现、代划、代扣、划转等服务，用户应按照本平台及第三方支付机构规定的流程提交以用户本人名义登记的有效银行借记卡等信息，经由审核通过后，用户存管账户与前述银行账户进行绑定。如用户未按照本平台规定提交相关信息或提交的信息存在错误、虚假、过时或不完整，或者本平台或第三方支付机构有合理的理由怀疑用户提交的信息存在错误、虚假、过时或不完整，本平台或第三方支付机构有权拒绝为用户提供银行卡认证服务，用户因此未能使用充值、取现、代扣等服务而产生的损失自行承担。
          <br> 2．充值：用户可以使用本平台指定的方式向用户绑定的存管账户充入资金，用于通过本平台进行交易。
          <br> 3．代收/代付：用户可以委托平台提供代收/代付服务，即自行或委托平台将用户银行卡里的款项通过第三方支付机构划付规则支付或收取本息、逾期费用等各类款项，或者将款项支付给用户指定的其他方。
          <br> 4．提现：用户可以根据第三方支付机构及其指定第三方支付机构的相关规则将存管账户中的资金转入经过认证的银行卡账户中。（根据用户提供的银行不同，会产生汇入时间上的差异，到账时间以实际到账为准）。
          <br>
          5．查询：本平台将对用户在本平台的所有操作进行记录，不论该操作之目的是否实现。用户可以通过用户账户实时查询用户账户名下的交易记录。用户理解并同意用户最终收到款项的服务是由用户经过认证的银行卡对应的银行提供的，需向该银行请求查证。用户理解并同意用户在平台进行的资金划转委托及相关交易记录，以银行系统、第三方支付机构等合作机构系统记录为准，用户通过本平台查询的任何信息仅作为参考，不作为相关操作或交易的证据或依据。
          <br> 用户了解，上述充值、代收/代付及取现服务涉及本平台与银行、第三方支付机构等第三方的合作。用户同意：(a)
          受银行、第三方支付机构等第三方仅在工作日进行资金代扣及划转的现状等各种原因所限，本平台不对前述服务的资金到账时间做任何承诺，也不承担与此相关的责任，包括但不限于由此产生的利息或其他损失；(b)
          一经用户使用前述服务，即表示用户不可撤销地授权本平台进行相关操作，且该等操作是不可逆转的，用户不能以任何理由拒绝付款或要求取消交易。就前述服务，本平台暂不会向用户收取费用，但用户应按照第三方的规定向第三方支付费用，具体请见第三方平台的相关信息。与第三方之间就费用支付事项产生的争议或纠纷，与本平台无关。
          <br> 6．用户每次使用本平台服务应直接登录本平台而不要通过邮件或其他平台提供的链接登录。
          <br>
          7．用户同意，本平台有权在提供本平台服务过程中以各种方式投放各种商业性广告或其他任何类型的商业信息（包括但不限于在本平台的任何页面上投放广告），并且，用户同意接受本平台通过电子邮件或其他方式向用户发送商品促销或其他相关商业信息。
          第七条 本平台将为用户提供以下合同管理服务：
          <br>
          1．在本平台交易需订立的合同采用电子合同方式。用户使用用户账户登录本平台后，根据本平台的相关规则，以用户账户ID在本平台通过点击确认、输入密码、签署电子签名或其他类似方式签署的电子合同即视为用户本人真实意愿并以用户本人名义签署的合同，具有法律效力。用户应妥善保管自己的账户密码等账户信息，用户通过前述方式订立的电子合同对合同各方具有法律约束力，用户不得以其账户密码等账户信息被盗用或其他理由否认已订立的合同的效力或不按照该等合同履行相关义务。
          <br>
          2．用户根据本协议以及本平台的相关规则签署电子合同后，不得擅自修改该合同。本平台向用户提供电子合同的保管、查看、核对服务。用户通过本平台签订的所有电子合同均统一由本平台保管。如对电子合同真伪或电子合同的内容有任何疑问，用户可通过登录账户下载合同并对合同进行核对。如对此有任何争议，应以本平台记录的合同为准。
          <br> 3．用户不得私自仿制、伪造在本平台上签订的电子合同或印章，不得用伪造的合同进行招摇撞骗或进行其他非法使用，否则由用户自行承担责任。
          <br> 第八条 收费服务：
          <br> 1. 用户通过本平台借款项目发布、查询风控报告或进行出借的，本平台均有权向用户进行收费。
          <br> 2.
          用户使用本平台收费服务，均应遵守本平台各服务规则。本平台可能根据实际需求对收费服务的收费标准、方式进行修改和变更，也可能会对部分免费服务开始收费。前述修改、变更或开始收费前，本平台将在相应服务页面进行通知或公告。如用户不同意上述修改、变更或付费内容，则应停止使用该服务。
        </div>

        <div class='pro-title'>第三章 账户安全及交易管理</div>
        <div class='pro-sub'>
           第九条 用户了解并同意，确保用户的账户及密码安全是用户的责任。用户将对利用用户的账户及密码所进行的一切操作及发表的言论负责，并同意以下事项：
          <br> 1．用户不得对他人泄露账户或密码，亦不可使用他人的账户和密码。因黑客、病毒或用户的保管疏忽等原因导致用户的账户遭他人非法使用的，本平台不承担任何责任。
          <br>
          2．本平台通过用户的用户账户及密码来识别用户的指令，用户确认，使用用户的账户和密码登录后在本平台的一切行为均代表用户本人并且是用户本人真实意思的表达。用户账户操作所产生的电子信息记录均为用户行为的有效凭据，并由用户本人承担由此产生的全部责任。
          <br> 3．冒用他人账户及密码的，本平台及其合法授权主体保留追究实际使用人连带责任的权利。
          <br> 第十条
          用户如发现有第三人冒用或盗用用户的账户及密码或其他任何未经合法授权的情形，应立即以有效方式通知本平台，要求本平台暂停相关服务，否则由此产生的一切责任由用户本人承担。同时，用户理解本平台对用户的请求采取行动需要合理期限，在此之前，本平台对第三人使用该服务所导致的损失不承担任何责任。
          <br> 第十一条 本平台有权基于单方独立判断，在其认为可能发生危害交易安全等情形时，不经通知而先行暂停或终止向用户提供本协议项下的全部或部分用户服务。前述情形包括但不限于：
          <br> 1．本平台查证用户提供的个人资料不具有真实性、有效性；
          <br> 2．本平台发现异常交易或有违约可能或有违法行为；
          <br> 3．用户有损害其他用户的行为；
          <br>4．本平台认为用户的账户涉嫌洗钱、套现、被冒用或其他本平台所认为有风险之情形；
          <br> 5．本平台认为用户已经违反本协议中的规定。

        </div>

        <div class='pro-title'>第四章 服务的中止和终止</div>
        <div class='pro-sub'>
           第十二条 用户同意，用户账户的暂停或终止不代表用户责任的消灭，用户仍应对使用本平台服务期间的行为承担可能的违约或损害赔偿责任。
          <br> 第十三条
          用户决定不再使用用户的账户时，应首先清偿所有应付款项（包括但不限于借款本金、利息、罚息、违约金、服务费、管理费等），再将用户账户中的可用款项（如有剩余）全部提现或者向本平台发出其它合法的支付指令，并向本平台申请注销用户的账户，经本平台审核同意后可正式注销用户的账户。
          <br> 第十四条
          除非用户申请终止本协议及注销相应账户且经本平台同意或者本平台终止本协议，否则本协议始终有效。在用户违反了本协议以及相关法律法规之规定或在相关政府部门的要求下，本平台有权终止本协议、关闭用户的账户或者限制用户使用本平台，并通过电子邮件、移动通信设配等方式告知用户。但本平台的该种行为不能免除用户根据本协议或在本平台生成的其他协议项下的还未履行完毕的义务。

        </div>

        <div class='pro-title'>第五章 守法义务及承诺</div>
        <div class='pro-sub'>
           第十五条 用户承诺绝不为任何非法目的或以任何非法方式使用本平台服务，并承诺遵守中国相关法律、法规及一切使用互联网之国际惯例，遵守所有与本平台服务有关的网络协议、规则和程序。
          <br> 第十六条 用户同意并保证不得利用本平台服务从事侵害他人权益或违法之行为，若有违反应负所有法律责任。上述行为包括但不限于：
          <br> 1．侵害他人隐私权、名誉、商业秘密、著作权、商标权、专利权及其他权益；
          <br> 2．违反依法律或协议所应负之保密义务；
          <br> 3．冒用他人名义使用本平台服务；
          <br> 4．涉嫌洗钱、套现或进行传销活动的；
          <br> 5．做出任何传染电脑病毒或是侵害本平台服务系統、资料等行为；
          <br> 6．侵犯本平台的商业利益；
          <br> 7．其他不适当行为。
          <br> 第十七条 用户承诺，由于用户违反本协议，或由于用户使用本平台服务违反了法律法规或侵犯了第三方的权利从而导致第三方提起相应的赔偿请求的，用户将对本平台及其关联方、合作伙伴、董事以及雇员给予全额补偿并使之不受损害。
          <br> 第十八条
          用户承诺，用户通过本平台上传或发布的信息均真实有效，用户向本平台提交的任何资料均准确、真实、有效。如用户因网上交易与其他用户产生纠纷的，其他用户有权通过司法部门要求平台提供相关资料。如因违背上述承诺，造成本平台或本平台其他用户损失的，用户将承担相应责任。
          <br> 第十九条 用户承诺，当本平台有足够的证据可以认定用户有损害其他注册用户利益的行为或违反本协议的行为时，本平台有权在本平台上公布用户的相关行为。
          <br> 第二十条 用户承诺，通过本平台发布借款项目时不从事下列行为：
          <br> 1．通过故意变换身份、虚构融资项目、夸大融资项目收益前景等形式的欺诈借款；
          <br> 2．同时通过多个网络借贷信息中介机构，或者通过变换项目名称、对项目内容进行非实质性变更等方式，就同一融资项目进行重复融资；
          <br> 3．在网络借贷信息中介机构以外的公开场所发布同一融资项目的信息；
          <br> 4．已发现网络借贷信息中介机构提供的服务中含有《网络借贷信息中介机构业务活动管理暂行办法》第十条所列内容，仍进行交易；
          <br> 5．法律法规和网络借贷有关监管规定禁止从事的其他活动。
          <br> 第二十一条 本平台承诺，不从事或者接受委托从事下列活动：
          <br> 1．为自身或变相为自身融资；
          <br> 2．直接或间接接受、归集出借人的资金；
          <br> 3．直接或变相向出借人提供担保或者承诺保本保息；
          <br> 4．自行或委托、授权第三方在互联网、固定电话、移动电话等电子渠道以外的物理场所进行宣传或推介融资项目；
          <br> 5．发放贷款，但法律法规另有规定的除外；
          <br> 6．将融资项目的期限进行拆分；
          <br> 7．自行发售理财等金融产品募集资金，代销银行理财、券商资管、基金、保险或信托产品等金融产品；
          <br> 8．开展类资产证券化业务或实现以打包资产、证券化资产、信托资产、基金份额等形式的债权转让行为；
          <br> 9．除法律法规和网络借贷有关监管规定允许外，与其他机构投资、代理销售、经纪等业务进行任何形式的混合、捆绑、代理；
          <br> 10．虚构、夸大融资项目的真实性、收益前景，隐瞒融资项目的瑕疵及风险，以歧义性语言或其他欺骗性手段等进行虚假片面宣传或促销等，捏造、散布虚假信息或不完整信息损害他人商业信誉，误导出借人或借款人；
          <br> 11．向借款用途为投资股票、场外配资、期货合约、结构化产品及其他衍生品等高风险的融资提供信息中介服务；
          <br> 12．从事股权众筹等业务；
          <br> 13．法律法规、网络借贷有关监管规定禁止的其他活动。

        </div>

        <div class='pro-title'>第六章 风险提示</div>
        <div class='pro-sub'>
           第二十二条 用户了解并认可，任何通过本平台进行的交易并不能避免以下风险的产生，本平台不能也没有义务为如下风险负责：
          <br> 1．政策风险：有关法律、法规及相关政策、规则发生变化，用户有可能遭受损失；
          <br> 2．违约风险：因其他交易方未按时足额履约，用户有可能遭受损失；
          <br>3．不可抗力因素导致的风险；
          <br> 4．因用户的过错导致的任何损失，该过错包括但不限于：决策失误、操作不当、遗忘或泄露密码、密码被他人破解、用户使用的计算机系统被第三方侵入、用户委托他人代理交易时他人恶意或不当操作而造成的损失；
          <br> 以上并未涵盖用户通过本平台进行交易的全部风险。用户在做出交易决策前，应全面了解相关交易，谨慎决策，并自行承担风险。
          <br> 第二十三条 基于互联网的特殊性风险，出现下列情况导致网络服务中止和终止的，本平台不承担任何责任：
          <br> 1．本平台系统维护期间；
          <br> 2．因为本平台或者第三方合作平台的设备、系统问题或者因为计算机病毒造成的故障。；
          <br> 3．由于黑客攻击、网络供应商技术调整或设备故障、平台升级等原因而造成的本平台服务中断或延迟；
          <br> 4．相关政府机构的要求。

        </div>

        <div class='pro-title'>第七章 责任范围及限制</div>
        <div class='pro-sub'>
          第二十四条 在任何情况下，对于用户使用本平台服务过程中涉及由第三方提供相关服务的责任由该第三方承担，本平台不承担该等责任。本平台不承担责任的情形包括但不限于：
          <br>(1) 因银行、第三方支付机构等第三方未按照用户或本平台指令进行操作引起的任何损失或责任；
          <br>(2) 因银行、第三方支付机构等第三方原因导致资金未能及时到账或未能到账引起的任何损失或责任；
          <br>(3) 因银行、第三方支付机构等第三方对交易限额或次数等方面的限制而引起的任何损失或责任；
          <br>(4) 因其他第三方的行为或原因导致的任何损失或责任。
          <br>第二十五条 因用户自身的原因导致的任何损失或责任，由用户自行负责，本平台不承担责任。本平台不承担责任的情形包括但不限于：
          <br>(1) 用户未按照本协议或本平台公布的规则进行操作导致的任何损失或责任；
          <br>(2) 因用户使用的银行卡的原因导致的损失或责任，包括用户使用未经认证的银行卡或使用非用户本人的银行卡或使用信用卡，用户的银行卡被冻结、挂失等导致的任何损失或责任；
          <br>(3) 用户向本平台发送的指令信息不明确导致的任何损失或责任；
          <br>(4) 用户账户内余额不足导致的任何损失或责任；
          <br>(5) 其他因用户原因导致的任何损失或责任。

          <br>第二十六条
          本平台的内容可能涉及由第三方所有、控制或者运营的其他平台的内容或链接（以下称“第三方平台”）。本平台不能保证也没有义务保证第三方平台上的信息的真实性和有效性。对于该等内容或链接，用户确认按照第三方平台的协议确定相关权利义务，而不是按照本协议。第三方平台的内容、产品、广告和其他任何信息均由用户自行判断并承担风险，而与本平台无关。
          <br> 第二十七条 用户自本平台及本平台工作人员或经由本平台服务取得的建议或资讯，无论其为书面或口头，均不构成本平台对本平台服务的任何保证。
          <br> 第二十八条 在法律允许的情况下，本平台对于与本协议有关或由本协议引起的任何间接的、惩罚性的、特殊的、派生的损失，不论是如何产生的，也不论是由对本协议的违约（包括违反保证）还是由侵权造成的，均不负有任何责任。
          <br> 第二十九条 除本协议另有规定外，在任何情况下，本平台对本协议所承担的违约赔偿责任总额不超过向用户收取的当次本平台服务费用总额。

        </div>

        <div class='pro-title'>第八章 用户信息及隐私权保护</div>
        <div class='pro-sub'>
          第三十条 本平台对于用户提供的、本平台自行收集的、经认证的个人信息将按照本协议予以保护、使用或者披露。
          <br>第三十一条 本平台有权通过其他合法渠道搜集用户的额外资料，以更好地掌握用户的情况，在提高用户交易安全性的同时，也便于本平台为用户提供更加优质高效的服务。
          <br>第三十二条 用户同意，本平台可在本平台的某些网页上使用诸如“Cookies”的资料收集装置。
          <br>第三十三条 本平台按照用户在本平台上的行为自动追踪用户的相关资料。在不透露用户的隐私资料的前提下，本平台有权对整个用户数据库进行分析。
          <br>第三十四条 用户同意,本平台可以使用用户的个人资料以改进本平台的推广和促销工作、分析平台的使用率、改善本平台的内容和产品推广形式，并使本平台的平台内容、设计和服务更能符合用户的需求。
          <br> 第三十五条 用户同意本平台利用用户的资料与用户联络并在某些情况下向用户传递针对用户的兴趣而提供的信息，例如：有针对性的广告条、管理方面的通知、产品提供等信息。
          <br> 第三十六条 在用户向本平台提供的资料与事实不符时，本平台有权根据实际的审核结果在不通知用户的情况下对用户所填写的与事实不符的资料进行更改。
          <br> 第三十七条 在本平台提供的交易活动中，除平台上无偿展示及有偿提供的用户信息资料外，用户无权要求本平台提供其他用户的其他资料，除非符合以下条件：
          <br> 1. 与用户有关的其他用户逾期未归还借款本息；
          <br> 2. 用户已向法院起诉其他用户的在本平台活动中的违约行为；
          <br> 3. 本平台所属公司出现被吊销营业执照、解散、清算、宣告破产等情形。
          <br> 第三十八条
          如用户通过注册成为本平台用户或与本平台签署有关协议等方式获得其他用户的个人资料，不得将该个人资料用于除还本付息或向借款人追偿以外的其他用途，除非该个人资料根据现行法律规定或应相关政府部门要求予以使用。
          <br> 第三十九条 用户不得利用本平台提供的服务或其他电子邮件转发服务发送垃圾邮件或其他可能影响本平台系统运行或违反本平台的用户协议或隐私条款的内容。
          <br> 第四十条 用户同意本平台可使用用户的资料用以解决与用户有关的纠纷，该资料包括但不限于本平台持有的有关用户的档案中的资料以及本平台通过其他方式自行收集的资料。
          <br> 第四十一条 用户因履行本协议提供给本平台的信息，除在发生借款交易时向平台其他用户提供信息外，本平台不会出售或免费共享给任何第三方，但以下情况除外：
          <br> 1．为提供独立服务需要，应服务方要求而提供与服务相关的必要信息的；
          <br> 2．具有合法调阅信息权限的政府部门或其他机构（如公安机关、法院等）从合法渠道调阅相关信息的；
          <br> 3．因律师事务所或会计师事务等机构评估审核平台情况，要求平台提供的；
          <br> 4. 根据相关监管要求向金融办、中国互联网金融协会等行业监管部门进行披露的；
          <br> 5. 本平台关联实体运营需要的；
          <br> 6．经本平台用户同意的。
          <br> 第四十二条 鉴于技术限制，本平台不能确保用户的个人资料不会通过本隐私条款中未列明的途径泄露出去，对此本平台不承担责任。
          <br> 第四十三条
          本平台有义务根据有关法律要求向司法机关和政府部门提供用户的个人资料。在用户未能按照与本平台签订的服务协议或者与本平台其他用户签订的协议等的约定履行自己应尽的义务时，本平台有权根据自己的判断或者与该笔交易有关的其他用户的请求披露用户的个人资料。用户出现逾期还款或违约时，本平台有权将用户拉入平台黑名单并将用户的逾期还款或违约行为在本平台予以公布。

        </div>

        <div class='pro-title'>第九章 知识产权的保护</div>
        <div class='pro-sub'>
          第四十四条 本平台上所有内容，包括但不限于著作、图片、档案、资讯、资料、平台架构、平台网页设计等，均由本平台依法拥有其知识产权，包括但不限于商标权、专利权、著作权、商业秘密等。
          <br>第四十五条 非经本平台书面同意，任何人不得擅自使用、修改、复制、公开传播、改变、散布、发行或公开发表本平台程序或内容。
          <br>第四十六条 用户未经本平台的明确书面同意不得对本平台或其内容进行任何衍生利用；不得为其他商业利益而下载或拷贝本平台内容，不得使用任何数据采集或类似的数据采集和摘录的工具对本平台的信息进行数据采集。
          <br>第四十七条
          未经本平台明确书面同意，用户不得使用本平台或其关联公司的商标、标识或其他专有信息（包括图像、文字、网页设计或形式）。未经本平台明确书面同意，用户不得以任何方式使用本平台或其关联公司的名字和商标进行商业活动。任何未经授权的使用，本平台都保留追究其法律责任的权利。
          <br>第四十八条 尊重知识产权是用户应尽的义务，如有违反，用户应对本平台承担损害赔偿等法律责任。

        </div>

        <div class='pro-title'>第十章 条款的解释、法律适用及争端解决</div>
        <div class='pro-sub'>
          第四十九条
          本协议是由用户与本平台共同签订的，用户在本平台的所有活动受本协议的约束。本协议内容包括但不限于协议正文条款及已经发布的或将来可能发布的各类规则，所有条款和规则为协议不可分割的一部分，与协议正文具有同等法律效力。
          <br>第五十条
          在本平台的某些部分或页面中，或者用户使用本平台相关服务产品的过程中，可能存在除本协议以外的单独的附加服务条款或协议，当这些服务条款或协议与本协议条款及规则存在冲突时，则前述本协议条款和规则以外的服务条款或协议将优先适用。
          <br>第五十一条 本协议的订立、生效、履行、解释及由此产生的所有事项均适用中华人民共和国法律。
          <br>第五十二条
          本协议中的部分条款无效，不影响其他条款的效力。若上述无效条款构成本协议经济目的之条款或核心条款，则该条款应被尽可能接近各方意图、能够保留本协议要求的经济目的且为有效的新条款所取代。在此情况下，本协议其他条款仍然有效。
          <br>第五十三条 因本协议所引起的用户与本平台的任何纠纷或争议，首先应友好协商解决，协商不成的，用户在此完全同意将纠纷或争议提交杭州信有诚互联网金融服务有限公司所在地有管辖权的人民法院诉讼解决。

        </div>
      </div>
    </div>
  </layout>
</template>
<script>
  export default {
    data() {
      return {
        isNavbar: true,
      }
    },
    created() {
    },
    methods: {}
  }
</script>
<style lang="less">
  @import "protocol";
</style>
